BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega809.PIC
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA04" edc:cname="CTRLECLR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force Update" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Force Restart" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Force Hard Reset" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA05" edc:cname="CTRLESET" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="UP" edc:desc="Count up" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DOWN" edc:desc="Count down" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force Update" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Force Restart" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Force Hard Reset" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA06" edc:cname="CTRLFCLR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0BV" edc:desc="Compare 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1BV" edc:desc="Compare 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2BV" edc:desc="Compare 2 Buffer Valid" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA26" edc:cname="PER" edc:mclr="1111111111111111" edc:nzwidth="0x10" edc:por="1111111111111111" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA07" edc:cname="CTRLFSET" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0BV" edc:desc="Compare 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1BV" edc:desc="Compare 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2BV" edc:desc="Compare 2 Buffer Valid" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA28" edc:cname="CMP0" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-----nnn" edc:addr="0xA09" edc:cname="EVCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="CNTEI" edc:desc="Count on Event Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVACT" edc:desc="Event Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="POSEDGE" edc:desc="Count on positive edge event" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ANYEDGE" edc:desc="Count on any edge event" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HIGHLVL" edc:desc="Count on prescaled clock while event line is 1." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA2A" edc:cname="CMP1" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn---n" edc:addr="0xA0A" edc:cname="INTCTRL" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnn---n" edc:addr="0xA0B" edc:cname="INTFLAGS" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA2C" edc:cname="CMP2" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA0E" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA0F" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA36" edc:cname="PERBUF" edc:mclr="1111111111111111" edc:nzwidth="0x10" edc:por="1111111111111111" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA38" edc:cname="CMP0BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA3A" edc:cname="CMP1BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA3C" edc:cname="CMP2BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
    </edc:RegisterMap>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0_ALT"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="CLKO" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS_ALT"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="EVOUT1" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA_ALT"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA_ALT"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3_ALT"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2_ALT"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3_ALT"/>
      <edc:VirtualPin edc:name="WO0B3" edc:ppsfunction="TCB3"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="LUT1_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA_ALT2"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="LUT1_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1"/>
      <edc:VirtualPin edc:name="WO0B3" edc:ppsfunction="TCB3_ALT"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA_ALT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT1_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C_ALT"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA_ALT2"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C_ALT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA_ALT2"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1_ALT"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA_ALT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1_ALT"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA_ALT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS_ALT"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT2_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_OUT1" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS_ALT"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AGND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1"/>
      <edc:VirtualPin edc:name="AIN9" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT4" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF0"/>
      <edc:VirtualPin edc:name="LUT3_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TOSC1" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART2"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF1"/>
      <edc:VirtualPin edc:name="LUT3_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART2"/>
      <edc:VirtualPin edc:name="TOSC2" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF2"/>
      <edc:VirtualPin edc:name="AIN12" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT5" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT3_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C_ALT2"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA_ALT5"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF3"/>
      <edc:VirtualPin edc:name="AIN13" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT3_OUT1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C_ALT2"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA_ALT5"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF4"/>
      <edc:VirtualPin edc:name="AIN14" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART2_ALT"/>
      <edc:VirtualPin edc:name="WO0B0" edc:ppsfunction="TCB0_ALT"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF5"/>
      <edc:VirtualPin edc:name="AIN15" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART2_ALT"/>
      <edc:VirtualPin edc:name="WO0B1" edc:ppsfunction="TCB1_ALT"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF6"/>
      <edc:VirtualPin edc:name="LUT3_OUT1" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RESET" edc:ppsfunction="OTHER"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART2_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UPDI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="CLKI" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="LUT0_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="LUT0_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT0_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C"/>
      <edc:VirtualPin edc:name="WO0B0" edc:ppsfunction="TCB0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C"/>
      <edc:VirtualPin edc:name="WO0B1" edc:ppsfunction="TCB1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0_ALT"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>